Revit 2026 API

# CeramicCeramicApplication Property

---

The property labeled "Finish" from the "Ceramic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string CeramicApplication { get; }
```
```vb
Public Shared ReadOnly Property CeramicApplication As String
	Get
```
```cpp
public:
static property String^ CeramicApplication {
	String^ get ();
}
```
```fsharp
static member CeramicApplication : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicApplicationType".

#### Reference

Ceramic Class

Autodesk.Revit.DB.Visual Namespace